Public Attributes | List of all members
API_Coord3D Struct Reference
Geolocation
Real (Cartesian) 3D coordinates of a three-dimensional space. More...
#include <APIdefs_Base.h>
 Public Attributes
double  | x
The x factor.
double  | y
The y factor.
double  | z
The z factor.
Detailed Description
Real (Cartesian) 3D coordinates of a three-dimensional space.
Remarks
It is a real 3D coordinate. Always expressed in meters, if no other instruction is given in the corresponding documentation.
Member Data Documentation
◆ x
 API_Coord3D::x
The x factor.
◆ y
 API_Coord3D::y
The y factor.
◆ z
 API_Coord3D::z
The z factor.